import streamlit as st
import random;
st.set_page_config(page_title="楽ちん献立アプリ",layout="wide")
st.title("🍽️ 楽ちん献立アプリ")

# 表示する料理のリスト
menus = [
    "堤煮込みハンバーグ",
    "タピオカパン",
    "Mac",
    "エスカルゴ",
    "水炊き",
    "シュールストレミング",
    "マーマイト",
    "サルミアッキ",
    "湯葉",
    "クリスマスケーキ",
    "一蘭",
    "堤焼きハンバーグ",
    "清松智祥",
    "センブリ茶",
    "カカオ99.9%",
    "ホンオフェ",
    "カブトムシ",
    "ノニ",
    "堤良太",
    "ダンボール",
    "メキシコサラマンダー",
    "ジャイアンシチュー",
    "HCl",
    "消毒液",
    "道端の草",
    "海水のみ",
    "化学教室の精製水",
    "物理教室の生卵",
    "「チ。」のかつら"
]
st.write("ボタンを押すと、今日の献立をランダムで1つ表示します！")

if st.button("🍳 献立を決める"):
    choice = random.choice(menus)

    st.success(f"今日の献立は…… **{choice}** です！")
    st.write("おいしく食べてね💝")
